{"pages":[{"title":"About me","text":"About me hehe(This page is under construction)","link":"/zhx-blog/about/index.html"}],"posts":[{"title":"📌 Hexo Development Checklist","text":".heimu { color: #000; background-color: #000; } .heimu:hover { color: #fff; } Here you can find my Hexo-Dev checklist and some useful hexo documentations Checklist &amp; Index: DONE: Image Youtube video Favicon and logo (solved) Live 2d widget (solved 2021-04-14) (Almost) Everything needed TOC (table of contents) (solved 2021-04-15) Email subscription system (solved 2021-04-15) Share (solved 2021-04-15) Categories (solved 2021-04-17) Create “About” page (solved 2021-04-17) Pin an article to top (solved 2021-04-17) Recommend instead of recent (solved 2021-04-17) Visitors of each post (solved 2021-04-17) code/mark (solved 2021-04-17) Visitor-traffics map Issue: can’t personalize it Change the Size of the Logo (solved 2021-04-18) Comments (no Ad) (solved 2021-04-18) Abbreviation Change (solved 2021-04-22) Costum logo (solved 2021-04-21) Syntax Highlighting Anchors in Markdown Encrypted Post - 2021-04-24 TODO: Friends Badge at footer limit height of and Sitemap Auto switch normal/dark mode not in the fabulous guide Widget Graphviz Change the tags style in the post page Change the article-meta line Weather widget Fold a part of the tags Fold a part of the archives Code highlight “Resources” list here (includes lots of useful documentations) which is basically a bunch of links (Under construction) Double live2d widget (?? worth it?) Complete “About” page 显示一言 ↑↑↑ 试着点击“显示一言”！ function showHitokoto (event) { event.target.classList.add('is-loading'); $.ajax({ type: 'GET', url: 'https://v1.hitokoto.cn/', success: function (data) { $('.hitokoto').text(data.hitokoto); event.target.classList.remove('is-loading'); } }); } Useful Documentations(Almost) Everything needed Fabulous guide about icarus Super Bulma demo Hexo 主题配置 - Icarus Basically you don’t need anything else hehe. XD. No no no. I actually got help from other websites like GitHub and Stack Overflow General Blog of the dev of the icarus theme Markdown syntax Tag Plugin Hexo Markdown Guide GitLab Hexo博客的Markdown语法 TOC Strange behaviour of TOC solution After deleted that plugin, the normal TOC showed up: Email subscription system A bilibili video RSS generator plugin download Google FeedBurner Wait wait, what does this mean? So there will be no email subscription via FeedBurner since this July? NOOOO! CommentsComments (Disqus) Follow this recipe Disqus official site Disqus is shit because you need to pay for premium in order to get rid of ADs. Damn it. Comments (GitTalk)Then I chose GitTalk, which is AD free :) I went to my repository and created a new issue. Then I copied and pasted the following code to the theme’s _config.yml file _config.ymlcomment: type: utterances repo: truezihaoxu/zhx-blog issue_term: pathname # Required if issue_number is not set issue_number: 1 # Required if issue_term is not set. Every post can be mapped to a separate, manually-created GitHub issue. label: some-issue-label # Optional theme: github-light # Optional crossorigin: anonymous And it’s done! ShareFirst, I chose ShareThis because the dev of this theme icarus also uses this plugin. But then I realized that something is wrong with ShareThis. So I changed to AddThis, which works perfecly now. The complete guide Sharethis official site AddThis official site ShareThis unexpected behaviour: CategoriesI didn’t consult any documents, I figured it out by myself 😆. Just add this to the header of my .md file: .mdcategory: [cat1] Tags and Categories are pretty much the same thing. Insert the code below to header of the .md file to get sub-category called “subcat1”: .mdcategories: [Hexo-Dev, subcat1] “About” pageJust type this at terminal and excute: BASHhexo new page &quot;About&quot; Pin an article to top The complete guide After the installation make sure to type down “top: True” in the header of the .md file. Abbreviation ChangeThe HB is a protein. .mdThe &lt;abbr title=&quot;Hemoglobin&quot;&gt;HB&lt;/abbr&gt; is a protein. Abbr is not working. Artistic process: making a costume logoI have been using the rotated version of the “NexT” logo for a while If you rotate \"N\" by 90º, you will get a \"Z\" XD.…it’s time to make my own logo! In night mode: In normal mode: Well, I have to say that I'm pretty satisfied with this logo 😆 For now I will keep my browser tab favicon as it is. Repositioning the live 2D widgetChanged height to 180 and the cat now sit on the bottom of the browser window (much better). _config.ymllive2d: enable: true scriptFrom: local pluginRootPath: live2dw/ pluginJsPath: lib/ pluginModelPath: assets/ tagMode: false log: false model: use: live2d-widget-model-hijiki display: position: right width: 150 height: 180 mobile: show: true react: opacity: 0.8 I don’t like the code highlight style above. I will talk about that later in Syntax Highlighting Syntax HighlightingProblem I didn’t use this link, but I will put it here since it might be useful in the future PrismJS Well, I do get some sort of highlight, but not what I actually want. What I want is this👇 style, but inside a real code block (so you can copy with one click and the code block gets its title): (...) display: position: right width: 150 - height: 300 + height: 180 (...) Hmmm I tried the “three inverse quote” method. Not good because I can’t change anything 😩: _config.yml(...) display: position: right width: 150&lt;span style=&quot;color:#e88080&quot;&gt;- height: 300&lt;/span&gt; &lt;--- WTF??&lt;span style=&quot;color:#21db40&quot;&gt;+ height: 180&lt;/span&gt; &lt;--- ????(...) Solution (Updated 2021-04-24)Haha finally I found how to do that: .config.yml- height: 300+ height: 180 Here is where I found this method: Highlight deleted and added lines with GitHub Markdown This is how I achived that (use 4 inverse quote to write triple inverse quote!): .md```diff .config.yml- height: 300+ height: 180``` Anchors in Markdown Anchors in Markdown Very easy: [Anchor name](#title-with-no-spaces) Encrypted PostDownload the plugin named “hexo-blog-encrypt” and follow the guide in this link This is my encrypted post Friends 为 ICARUS 而生的友情链接页面 End of the page &nbsp;&nbsp; Hexo logo","link":"/zhx-blog/2021/04/15/Hexo-Development-Check-List/"},{"title":"Fuck! I give up graphviz","text":"&amp;#%$#%#&amp;$”!#&amp;$!!!!!!!!!!!!!! The problemThere is only two or three documentaries about graphviz in hexo. Nothing have worked out. I officially announce that I give up.I wanted to use the graphviz to improve my study efficiency, but right now it is slowing me down, which is exact the oppsit of what I want Lmao. Solutions tried (and failed of course) The Karobben Method The hexo-tag-graphviz Method What now?The online editor called edotor is perfect!!! I will just make the graph and take a screenshot or whatever :) It is good.","link":"/zhx-blog/2021/04/29/fk-i-give-up-graphviz/"},{"title":"Revisão de Imunidade","text":"Language: Portuguese Falta uma semana para o teste. Vamos fazer revisões! Índice Tipos de leucócitos Mecanismos de defesa não específicos Barreiras físicas Fagocitose Resposta inflamatória Interferão Sistema de complemento Mecanismos de defesa específicos Imunidade humoral Imunidade celular Momória imunitária Imunização Desequilíbrios e doenças Alergia Doenças autoimunes Imunodeficiência Tipos de leucócitos Tipo Núcleo Granulações? Função Neutrófilos Poliloblado Sim Fagocitose Eosinófilos Biloblado Sim Parasitas Basófilos Irregular Sim Histamina Linfócitos Esférico Não Vários Monócitos Forma de rim Não Macrófago NeutrófilosSão os primeiros que chagam ao local infetado. Realizam fagocitose para eliminar as agentes invadores. EosinófilosPrincipalmente luta contra os parasitas: liberta enzimas que os destroem. BasófilosContém histamina que intervêm nas reações imunitárias. LinfócitosTem vários tipos de linfócitos que são importantes nos mecanismos de defesa não específicos. Os linfócitos provem de linfoblastos. Natural killer: Principalmente luta contra tumores e cancros. MonócitosOs monócitos podem atravessar os vasos sanguíneos e se transformar em macrófagos. Mastócitos“Guardas locais” que libertam histamina que atraem os fagócitos após ter contacto com os agentes invasores Mecanismos de defesa não específicosMecanismos de defesa não específicos são mecanismos que defendem o nosso sistema imunitário de uma forma geral. Barreiras físicasBarreiras físicasA pele inacta serve de barreira para a maioria de micro-organismos. As glândulas sudoríparas, sebáceas e lacrimais produzem secreções que são tóxicas para muitos micro-organismos, impedindo o seu desenvolvimento As mucosas do tubo digestivo e órgãos genitais, a lisozima presente na saliva e nas lágrimas e ácido clorídrico e suco gástrico presentes no estômago podem eliminar os micro-organismos. O muco produzida pelas mucosas que se encontram nas superfícies respiratórias e vias genitais contém uma substância chamada mucina que é tóxico para os micro-organismos. Além disso, o muco pode aprisionar os micro-organismos e estes são transportados pelo cílio através dos movimentos vibráteis. FagocitoseOs micro-organismos são destruidos pelos fagócitos através de fagocitose.Captação por pseudópodes (prolongamento da membrana citoplasmática) ou ingestão -&gt; Digestão (a lisossoma que contém enzima digestiva junta-se a vesícula endocítica, formando a vesícula digestiva) -&gt; Destruição do micro-organismos e exocitose da parte não digerida Resposta inflamatóriaOcorre a resposta inflamatória se a primeira barreira de defesa for ultrapassada, atuando como se fosse a segunda barreira de defesa. FebreQuando uma resposta inflamatória não foi suficiente, ocorre um resposta sistemática. Febre é um tipo de resposta sistemática, pois envolve a cooperação de vários órgãos. InterferãoCélulas infetadas por vírus vai libertar um tipo de proteína para o fluido intersticial. Este tipo de proteína, que é denominada interferão, desencadeia um processo de produção das proteínas antivirais nas células que se encontram nas proximidades da célula infetada, através de enviar sinais químicos para o núcleo. Como estas proteínas antivirais não são específicas, o interferão pode conferir às células capacidade de bloquear vários tipos de vírus diferentes. Sistema de complemento (3)Complemento são proteínas que se circulam livremente no sangue de forma inativa. Quando detetam uma ligação entre antigénio e anticorpo, desencadeiam uma cascata de reações químicas, ativando o sistema de complemento. Estas proteínas tem as seguintes funções: Aglutinação de bactérias, facilitando a fagocitose; Provocação de lise das bactérias após a adesão a parede celular destas mesmas. Estimula a mastócitos a libertarem histaminas (para provocar quimiotaxia). Mecanismos de defesa específicosImunidade humoralOs linfócitos B que são produzidos e maturados na medúla óssea são responsáveis por este tipo de imunidade. Estes linfócitos não ataquem os agentes agressores diretamente, mas sim através do anticorpo que produzem. A estrutura dos anticorposTêm uma forma de “Y”, possuem uma cadeia pesada e duas cadeias leves. A cadeia pesada determina a sua classe, enquanto a cadeia leve determina com que antigénio é que vai ligar. Anticorpos (Imunoglobulina) e as suas funções Tipo Localização Função Ig A Leite, lágrimas e sistema digestivosjo São os primeiros a agir após uma infeção Ig D Na membrana dos linfócitos B Estimula os linfócitos B a produzirem outro tipo de anticorpos Ig E Nos mastócitos Controla a secreção de histamina (que faz quimiotaxia aos fagócitos) Ig G Plasma e linfa intersticial Combater contra bactérias Ig M Plasma Combater contra bactérias O termo “anticorpos” referem principalmente às suas estruturas, enquanto o termo “imunoglobulina” remete para a sua função. A ação das imunoglobulinas (5) Neutralização dos antigénios das bectérias/vírus, tornando-os incapazes de entrar nas células; Aglutinação das bactérias, facilitando a fagocitose; Precipitação das substâncias tóxicas. O precipitado vai ser removido por mastócitos posteriormente; Ativação do sistema de complementos (lise das bactérias, aglutinação, estimulação dos mastócitos…); Estimulação da fagocitose. Funcionamento dos linfócitos B Seleção colonal: O contacto com o antigénio vai ativar apenas os linfócitos B que possuem o respetivo anticorpo. Multiplicação das células selecionadas. Os linfócitos B diferenciam-se em plasmócitos e células-memória. Produção de grande quantidade de anticorpos (geralmente Ig G) pelos plasmócitos para neutralizar o antigénio. *A crise passa os plasmócitos morrem, pois apenas vivem um curto período do tempo, enquanto as células-memória permanecem vivos durante muito tempo (até anos). Ver “momória imunitária” Imunidade celularOs linfócitos T que são produzidos na medúla óssea e que são maturados no timo são responsáveis por este tipo de imunidade. Os T citocócicos (ou citolíticos) libertam substâncias tócicas capazes de destruir a célula-alvo (que podem ser células infetadas ou células cancerosas), enquando os T helpers (ou auxiliares) vai ativanto todo o sistema imunitário. Papel de macrófagosApós a destruição de um tipo de vírus (por exemplo), parte de antigénio deste vírus pode ligar aos recetores presentes na membrana do macrófago (complexo maior de histocompabilidade (MHC)), formando antigénio-MHC. Estes macrófagos são denominadas “células apresentadoras de antigénio”. Estes antigénios podem ser identificado por linfócitos T que possuem o respetivo anticorpo (Seleção colonal). Os linfócitos T vai se multiplicar (proliferação colonal) e se diferenciar em T citotóxicos (Tc) e em T helpers (Th). Os Tc vão destruir as céluas infetadas ou cancerosas, libertando citoquinas é esse o nome!. Os Th vão ativar todo o sistema imunitário (linfócitos T e B, macrófagos, etc.) Momória imunitáriaQuando o organismo é exposto a um agente patogénico pela primeira vez, são produzidas células-memória Ver “Funcionamento dos linfócitos B”.Quando o organismo é exposto ao mesmo agente patogénico pela segunda vez (vamos chamá-lo “A”), é desencadeada a reação seguinte: Parte das células-memória de A vai se diferenciar em plasmócitos e produzir o anticorpo anti-A. Ocorre a produção de grande quantidade do anticorpo anti-A, por isso mesmo é frequente que a segunda exposição a A não chege a manifestar sintomas, pois é eliminado rapidamente. Nota que a memória imunitária é específica, ou seja, a memória de A não se aplica em B (outro tipo de agente patogénico). ImunizaçãoA imunização divide-se em dois grupos: imunização ativa e passiva.Cada um destes grupos podem ser dividido em dois classes: artificial e natural. Imunidade AtivaNaturalO indivíduo é exposto naturalmente ao antigénioArtificialO indivíduo, por exemplo, recebe uma vacina.Imunidade PassivaNaturalAs crianças recebem os anticorpos da mãe através da placenta e cordão umbilicalArtificialO indivíduo recebe um soro de anticorpos produzidos por outra pessoa ou animal Na imunização ativa, somos o nosso organismo que produzem o anticorpo, enquanto na passiva estamos a receber anticorpos que não sejam produzidos por nós próprios. VacinasExistem vários tipos de vacinas: vacinas de microragnismo completo, vacinas de parte de microrganismo ou vacinas recombinantes. Ao administrarmos a vacina, é desencadeado uma resposta imunitária primária, produzindo células-memórias para o antigénio em causa. Quando somos expostos ao antigénio pela segunda vez, o nosso organismo vai desencadear uma resposta imunitária secundária, permitindo uma rápida eliminação dos antigénios. A vacina pode perder o seu efeito protetora por desaparecimento das células-memórias ou por mutações do próprio antigénio. Desequilíbrios e doençasAlergiaA alergia é um tipo de hipersensibilidade em que o sistema imunitário reage exageradamente perante um certo antigénio. Doenças autoimunesImunodeficiência","link":"/zhx-blog/2021/04/28/rev-bio-imun/"},{"title":"Revisões Gramaticais","text":"Language: Portuguese Falta apenas um dia para o teste. Vamos fazer umas revisões, especialmente conteúdos novos (não estou muito peocupado com funções sintáticas e orações) Índice Génese Fonética e fonologia Lexicologia Relações semânticas entre as palavras Estruturas lexicais Processos irregulares de formação de palavras Semântica Valor temporal Valor aspetual Valor modal Discurso Coesão textual GéneseFonética e fonologiaInserção (PEP)Prótesescibere &gt; escrever Epêntesehumile &gt; humilde Paragogeante &gt; antes Remoção (ASA)Aféreseepiscopu &gt; bispo Síncopeanimales &gt; animaes &gt; animais Apócopeplenum &gt; pleno AlteraçãoSonorização consoante surda (entre vogais) para uma sonorafocu &gt; fogo Palatalização grupo consonântico para um som palatalfiliu &gt; filho Redução vocálica enfrequecimento de uma vogal quando passa para posição átonatolo &gt; tolinho Contração Crase - Contração de duas vogais numa só legere &gt; leer &gt; ler Sinérse - contração de duas vogais num ditongo lege &gt; lee &gt; lei Vocalização passagem de uma consoante a vogalmulto &gt; muito Metátese mudança de opsição de fonemas dentro de uma palavrasemper &gt; sempre Assimilaçãoipso &gt; isso Dissimilaçãolilio &gt; lírio LexicologiaRelações semânticas entre as palavrasHierarquiaHiperónimo tem hierarquia mais alto do que hipónimo (hiperonímia e hiponímia)“Hipopótamo está dentro de hipermercado” Todo/parteHolónimo é constituido pelos merónimos (holonímia e meronímia) Estruturas lexicaisCampo lexicalÉ o conjunto de palavras associadas a mesmo tema. Campo semânticaÉ o conjunto de significados que uma mesma palavra pode ter em diferentes circunstâncias Processos irregulares de formação de palavrasExtensão semântica - pega numa palavra pre existente e dá-la novos significados ratoEmpréstimo - pega numa palavra estrangeira e usá-la futebolAmálgama - palavra criada pela junção de partes de duas ou mais palavrasSigla - abreviação (pronuncia-se letra a letra) CGTPAcrónimo - abreviação (pronuncia-se como se fosse uma única palavras) TAPTruncação - criação de uma versão simplificada da palavra fotoOnomatopeia - imitar sons miau SemânticaValor temporalSimultaneadadequando, neste momento… Anterioridadedesliguei, venceu, ontem… PosterioridadeVou descansar, amanhã… Valor aspetualAspeto perfetivoTraduz uma situação culminada (acabada)Já li o livro Aspeto imperfetivoTraduz uma situação não culminadaEstou a ler o livro Aspeto habitualSitua, na linha temporal, um evento que se sucede numa pluralidade infinita de situaçõesHabitualmente, eu leio livro no fim das refeições Aspeto genéricoSitua, na linha temporal, um evento como atemporal e verdadeiro em qualquer situação de enunciaçãoDemora tempo a ler um livro. Aspeto iterativoSitua, na linha temporal, um evento que se repete regularmente durante um determinado período de tempoEu tenho lido este livro nos últimos dias Valor modalModalidade apreciativaExpressar apreciações positivas ou negativas.Fizeste um trabalho excelente! Modalidade epistémicaRepresentar valores de probabilidade ou certeza.Talvez fiz o trabalho. Modalidade deônticaRepresentar valores de permissão ou obrigação.Tens de fazer o trabalho. DiscursoCoesão textualCoesão lexicalReiteração - uso da mesma palavra ao longo do discursoGosto de ouvir a música. Estou sempre a ouvir música. Substituição - uso das diferentes palavras que pertencem ao mesmo campo lexical ao longo do discursoNão durmo sem ouvir música. Os sons ajudam-me a adormecer Coesão gramaticalCoesão referencial - uso de pronomesO António está doente. Encontro-o no hospital Coesão temporal - sequência lógica do tempo Coesão frásica - a concordância entre diferentes elementos da mesma frase Coesão interfrásica - tem a ver con orações","link":"/zhx-blog/2021/04/25/revisoes-gramaticais/"},{"title":"Encrypt01","text":"22064b17c03cb0c0e58c99349b6889d0b31470871e725085fde7c8feed9af7efd5f9fe9b063c1a360875e0012a61f741669ddd0d914beb9dc22bc172639379ce50fa949fbcd20846978af25c64e88775cb899c60ef4a7484474e0e65e13bd00680b326a2ea21a80527cf527023536e452c06fe6e6f9184246dedeb1d9f80236594cf1e886fe67550db95376c5441abbd11c00fbd6fb879728dcfc6553eb0bd00d888cd29edc5fd511c9b7bde41719b7dc6571b3e8b479a55f7bdc650737f2e7035c07ce751d703fc29dfd3756edb93f22622a2f8188fb3f705063959a06de7d10055c966b3a52351b38a1e26cefb73d8421968a9cd75df0c18e231c35d0797130cd8d631a907457f94e6e3de8568173b263499b69b6d7c14bc0e31028168475ed704b238f9045e34df9b333d14e9608e55e5b505ca30c9a7137772017794735b55deab96eb464be93f0ab5166435642a0336f4fcddb04af89561ba601b0b3d6690896893e66b715f4530b81f8cdc1bc7bcf19f17c54c0b26e11b3fa4259fa249a65c30adaeccf5bdd0ab167fa305f456997669af7972666b6e1ea7942799f9a7 Hey, password is required here.","link":"/zhx-blog/2021/04/24/encrypt1/"},{"title":"I figured out how the mail system works","text":"The email only send one email at 16:00 (UTC+1) of each day.Well, nothing to worry about!","link":"/zhx-blog/2021/04/16/I-figured-out-how-the-mail-system-works/"},{"title":"Just a random new post to test email delivery system","text":"Let’s testAre you going to sent this new post to my subscriber, Google FeedBurner?? Please do it!","link":"/zhx-blog/2021/04/16/Just-a-random-new-post-to-test-email-delivery-system/"},{"title":"This is a post without images","text":"Yes. This is a post without any kind of images, including thumbnail, cover, etc. The reason why of making this post is that the mailing system didn’t push the last post (the one with images of iOS mail app) to the subscribed email.I suspect that it is because of the images: FeedBurner’s useless server is not willing to store my images and push them to my mail.","link":"/zhx-blog/2021/04/16/This-is-a-post-without-images/"},{"title":"Email subscription system is working, but there&#39;s still something weird...","text":"After doing some Google FeedBurner stuff, I managed to subscribe my own blog with my own email. So this is the first “blog update” email I have ever received: Well, what is the “werid thing” that I’ve talked before?Look at this, google still thought that I have zero subscribers. Maybe it just refreshes at a slow manner. So nothing to worry about right now, since the system is working normally. Update 2021-04-16Seems like that my email is successfully subscribed to my blog 😊 I’m happy.","link":"/zhx-blog/2021/04/15/Email-subscription-system-is-working-but-there-s-still-something-weird/"},{"title":"Successfully changed live 2d widget","text":"I successfully changed live 2d widget to a cat (well the ideal for me is some mecha-stylled widget wwww). The next step is to add two of them, one on the right side and another on the left. First thing to do is to install the 2d widget helper: BASHnpm install --save hexo-helper-live2d Next, install the model that I wanted: hijiki the cat: BASHusage: npm install {packagename}npm install live2d-widget-model-hijiki Then add the following code to the main \"_config.yml\" file (not the “_config.yml” of the theme): _config.ymllive2d: enable: true scriptFrom: local pluginRootPath: live2dw/ pluginJsPath: lib/ pluginModelPath: assets/ tagMode: false log: false model: use: live2d-widget-model-hijiki display: position: right width: 150 height: 300 mobile: show: true react: opacity: 1.0 Then everthing works normally.","link":"/zhx-blog/2021/04/15/Successfully-changed-live2d-widget/"},{"title":"Maybe I found the reason of the incorrectness of the Safari tab favicon","text":"Soooo actually the safari tab favicon of newer pages is correct.&lt;(｀^′)&gt; Now I’m using Chrome. It is way better for web development! My explaination of the bad Safari favicon is: I don’t have that image in my local folders, hence the old favicon has to be stored in a Safari server. The favicon should be somehow “associated” to my blog’s link, so every time that some one opens my blog’s main page, Safari will put the icon stored in Safari’s server into user’s Safari tab icon. The old icon is not refreshed in the server end.When I create a new page, a new link is created. Then, the Safari’s server will store the correct favicon which is associated only to my new pages, but not the old ones.Solution: wait maybe one week or one month. Let’s see if the lazy Safari server refresh :/","link":"/zhx-blog/2021/04/15/Maybe-I-found-the-reason-of-icorrect-Safari-tab-favicon/"},{"title":"Let&#39;s try to make a table of content","text":"Issue: table of content not working correctlyBehaviour: no highlight of the current section; can’t jump to a title by clicking on it. Solution: delete a plugin called “hexo-toc” that I’ve installed previously using this command: npm uninstall hexo-toc So here is my test text: Enjoy 😑 Section 1content Sub section 1Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Interdum velit euismod in pellentesque massa placerat duis ultricies. Nam at lectus urna duis. Eu ultrices vitae auctor eu augue ut lectus. Tempus quam pellentesque nec nam aliquam sem et. Tempus quam pellentesque nec nam. Tempor commodo ullamcorper a lacus vestibulum. Porttitor eget dolor morbi non. Nec feugiat nisl pretium fusce. Enim nulla aliquet porttitor lacus luctus accumsan tortor posuere. Sollicitudin aliquam ultrices sagittis orci a scelerisque purus semper eget. Nulla pellentesque dignissim enim sit amet venenatis urna. Nunc sed blandit libero volutpat sed cras ornare arcu dui. Proin libero nunc consequat interdum varius sit amet. In pellentesque massa placerat duis ultricies lacus sed turpis tincidunt. Tellus integer feugiat scelerisque varius morbi. Aliquet eget sit amet tellus cras adipiscing. At imperdiet dui accumsan sit amet nulla facilisi morbi. Mattis aliquam faucibus purus in massa tempor nec feugiat nisl. This is a big headingLorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Interdum velit euismod in pellentesque massa placerat duis ultricies. Nam at lectus urna duis. Eu ultrices vitae auctor eu augue ut lectus. Tempus quam pellentesque nec nam aliquam sem et. Tempus quam pellentesque nec nam. Tempor commodo ullamcorper a lacus vestibulum. Porttitor eget dolor morbi non. Nec feugiat nisl pretium fusce. Enim nulla aliquet porttitor lacus luctus accumsan tortor posuere. Sollicitudin aliquam ultrices sagittis orci a scelerisque purus semper eget. Nulla pellentesque dignissim enim sit amet venenatis urna. Nunc sed blandit libero volutpat sed cras ornare arcu dui. Proin libero nunc consequat interdum varius sit amet. In pellentesque massa placerat duis ultricies lacus sed turpis tincidunt. Tellus integer feugiat scelerisque varius morbi. Aliquet eget sit amet tellus cras adipiscing. At imperdiet dui accumsan sit amet nulla facilisi morbi. Mattis aliquam faucibus purus in massa tempor nec feugiat nisl. This is a small headingLorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Interdum velit euismod in pellentesque massa placerat duis ultricies. Nam at lectus urna duis. Eu ultrices vitae auctor eu augue ut lectus. Tempus quam pellentesque nec nam aliquam sem et. Tempus quam pellentesque nec nam. Tempor commodo ullamcorper a lacus vestibulum. Porttitor eget dolor morbi non. Nec feugiat nisl pretium fusce. Enim nulla aliquet porttitor lacus luctus accumsan tortor posuere. Sollicitudin aliquam ultrices sagittis orci a scelerisque purus semper eget. Nulla pellentesque dignissim enim sit amet venenatis urna. Nunc sed blandit libero volutpat sed cras ornare arcu dui. Proin libero nunc consequat interdum varius sit amet. In pellentesque massa placerat duis ultricies lacus sed turpis tincidunt. Tellus integer feugiat scelerisque varius morbi. Aliquet eget sit amet tellus cras adipiscing. At imperdiet dui accumsan sit amet nulla facilisi morbi. Mattis aliquam faucibus purus in massa tempor nec feugiat nisl. Porttitor rhoncus dolor purus non enim praesent elementum facilisis. Adipiscing diam donec adipiscing tristique risus nec feugiat in. Nisi scelerisque eu ultrices vitae auctor eu augue ut. Nulla facilisi cras fermentum odio eu feugiat pretium nibh. Quis commodo odio aenean sed adipiscing diam donec adipiscing tristique. Dui accumsan sit amet nulla facilisi morbi tempus iaculis urna. Lobortis elementum nibh tellus molestie nunc non blandit massa. Amet venenatis urna cursus eget nunc scelerisque viverra mauris in. Turpis cursus in hac habitasse platea dictumst quisque. Ultricies mi quis hendrerit dolor magna eget est lorem ipsum. Enim nunc faucibus a pellentesque sit amet porttitor. Dui vivamus arcu felis bibendum ut tristique et egestas quis. Auctor neque vitae tempus quam pellentesque nec nam. Nec ullamcorper sit amet risus. Eu non diam phasellus vestibulum lorem sed risus ultricies. Id diam vel quam elementum. Consequat nisl vel pretium lectus quam. Nunc consequat interdum varius sit. Velit aliquet sagittis id consectetur purus ut. Est velit egestas dui id ornare. Donec et odio pellentesque diam volutpat commodo. In fermentum posuere urna nec tincidunt praesent semper feugiat. Nunc lobortis mattis aliquam faucibus purus in massa tempor. Elit pellentesque habitant morbi tristique senectus. Risus quis varius quam quisque id diam vel quam elementum. Et malesuada fames ac turpis egestas. Non nisi est sit amet facilisis magna etiam. Laoreet id donec ultrices tincidunt. Aliquet nibh praesent tristique magna sit. Molestie ac feugiat sed lectus vestibulum mattis. Dictumst vestibulum rhoncus est pellentesque. Viverra adipiscing at in tellus integer. Nibh venenatis cras sed felis eget velit aliquet sagittis. Pretium fusce id velit ut tortor. Sit amet commodo nulla facilisi nullam vehicula ipsum a arcu. This is a small heading 2Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Interdum velit euismod in pellentesque massa placerat duis ultricies. Nam at lectus urna duis. Eu ultrices vitae auctor eu augue ut lectus. Tempus quam pellentesque nec nam aliquam sem et. Tempus quam pellentesque nec nam. Tempor commodo ullamcorper a lacus vestibulum. Porttitor eget dolor morbi non. Nec feugiat nisl pretium fusce. Enim nulla aliquet porttitor lacus luctus accumsan tortor posuere. Sollicitudin aliquam ultrices sagittis orci a scelerisque purus semper eget. Nulla pellentesque dignissim enim sit amet venenatis urna. Nunc sed blandit libero volutpat sed cras ornare arcu dui. Proin libero nunc consequat interdum varius sit amet. In pellentesque massa placerat duis ultricies lacus sed turpis tincidunt. Tellus integer feugiat scelerisque varius morbi. Aliquet eget sit amet tellus cras adipiscing. At imperdiet dui accumsan sit amet nulla facilisi morbi. Mattis aliquam faucibus purus in massa tempor nec feugiat nisl. Porttitor rhoncus dolor purus non enim praesent elementum facilisis. Adipiscing diam donec adipiscing tristique risus nec feugiat in. Nisi scelerisque eu ultrices vitae auctor eu augue ut. Nulla facilisi cras fermentum odio eu feugiat pretium nibh. Quis commodo odio aenean sed adipiscing diam donec adipiscing tristique. Dui accumsan sit amet nulla facilisi morbi tempus iaculis urna. Lobortis elementum nibh tellus molestie nunc non blandit massa. Amet venenatis urna cursus eget nunc scelerisque viverra mauris in. Turpis cursus in hac habitasse platea dictumst quisque. Ultricies mi quis hendrerit dolor magna eget est lorem ipsum. Enim nunc faucibus a pellentesque sit amet porttitor. Dui vivamus arcu felis bibendum ut tristique et egestas quis. Auctor neque vitae tempus quam pellentesque nec nam. Nec ullamcorper sit amet risus. Eu non diam phasellus vestibulum lorem sed risus ultricies. Id diam vel quam elementum. Consequat nisl vel pretium lectus quam. Nunc consequat interdum varius sit. Velit aliquet sagittis id consectetur purus ut. Est velit egestas dui id ornare. Donec et odio pellentesque diam volutpat commodo. In fermentum posuere urna nec tincidunt praesent semper feugiat. Nunc lobortis mattis aliquam faucibus purus in massa tempor. Elit pellentesque habitant morbi tristique senectus. Risus quis varius quam quisque id diam vel quam elementum. Et malesuada fames ac turpis egestas. Non nisi est sit amet facilisis magna etiam. Laoreet id donec ultrices tincidunt. Aliquet nibh praesent tristique magna sit. Molestie ac feugiat sed lectus vestibulum mattis. Dictumst vestibulum rhoncus est pellentesque. Viverra adipiscing at in tellus integer. Nibh venenatis cras sed felis eget velit aliquet sagittis. Pretium fusce id velit ut tortor. Sit amet commodo nulla facilisi nullam vehicula ipsum a arcu. Malesuada nunc vel risus commodo viverra maecenas accumsan lacus. Et sollicitudin ac orci phasellus egestas tellus rutrum tellus pellentesque. Eget lorem dolor sed viverra ipsum nunc. Orci dapibus ultrices in iaculis nunc sed augue. Habitant morbi tristique senectus et netus et. A diam sollicitudin tempor id eu nisl nunc mi ipsum. Nam libero justo laoreet sit amet. Morbi tincidunt augue interdum velit. Felis eget nunc lobortis mattis aliquam faucibus purus in. Dui faucibus in ornare quam viverra orci sagittis. Metus dictum at tempor commodo ullamcorper a lacus vestibulum sed. Nec ullamcorper sit amet risus nullam eget felis eget. Euismod lacinia at quis risus sed. Sagittis nisl rhoncus mattis rhoncus urna neque viverra justo. Dui vivamus arcu felis bibendum ut tristique et. Enim ut sem viverra aliquet eget sit. Egestas maecenas pharetra convallis posuere morbi leo urna. Imperdiet proin fermentum leo vel orci porta. Faucibus nisl tincidunt eget nullam. Pharetra sit amet aliquam id. Felis imperdiet proin fermentum leo vel orci porta non pulvinar. Blandit cursus risus at ultrices mi tempus. Turpis cursus in hac habitasse platea. Elementum tempus egestas sed sed risus. Egestas tellus rutrum tellus pellentesque eu tincidunt tortor aliquam. Ultricies integer quis auctor elit. Orci phasellus egestas tellus rutrum tellus. Quis blandit turpis cursus in hac habitasse. This is a small heading 3This is a small heading 4This is a small heading 5This is a small heading 6","link":"/zhx-blog/2021/04/14/Let-s-try-to-make-a-table-of-content/"},{"title":"Doggo Vaccine","text":"Doggo got a vaccine ehehe.We went to a veterinary clinic at Arroios to get her a vaccine. The vaccination was a success. Everyone is happy.","link":"/zhx-blog/2021/04/13/Doggo-Vaccine/"},{"title":"I give up","text":"Damn it. I have been working on this for say more than 4 hours, but the damn Safari favicon never changed at all. Where the fuck did the Safari get that old favicon? WHERE IS THAT GOD DAMN OLD IMAGE’s SOURCE FILE??? WHERE IS MY NEW IMAGE???The source code (index.html) says that everything is in its place. But the God Damn favicon didn’t refresh. Everyting is working on Chrome. The shortcut icon on Safari works perfectly. Why the stupid tab icon didn’t change? I already tried:1: Open my website at Private mode (Safari)2: Delete all Safari favicon cache that I found in this directory: ~/Library/Safari/Favicon Cache/ 3: Restart computerNothing above worked!But the Chrome has everything CORRECT! Damn it.No more hexo for today. I was really happy when I can put image on my site in the afternoon, but now I’m kinda pissed off.Oh btw, it was quite boring typing “hexo clean”, “hexo g” and “hexo d”. Not to mention the time that you have to wait between these commands. I found that this is a “compact version” of deploy command, it’s quite handy: hexo clean &amp;&amp; hexo g --d","link":"/zhx-blog/2021/04/12/I-give-up/"},{"title":"Solved site logo not appearing in a hilarious way","text":"Just RESIZE that God Damn safari window and my logo (fraud alert! XD) appeared!Now I finally solved the logo problem, one more to go:favicon displays differentely on Safari and Chrome wtf?","link":"/zhx-blog/2021/04/12/Solved-site-logo-not-appearing-in-a-hilarious-way/"},{"title":"First Post With Image (Fixed)","text":"My first try failed, but now (after n tries) it is working normally!Now the images doesn’t have a description…why? (•_•;","link":"/zhx-blog/2021/04/12/First-Post-With-Image-Fixed/"},{"title":"test-img","text":"Image is working after excuting this command in terminal (pwd: zhx-hexo): npm install https://github.com/7ym0n/hexo-asset-image --save The code above was copied from: CSDN Video example:","link":"/zhx-blog/2021/04/12/test-img/"},{"title":"First Post With Image (Original)","text":"Cover ratio = 660:283","link":"/zhx-blog/2021/04/12/1st-image/"},{"title":"Solved no CSS style after generation (hexo g)","text":"Just add this code into _congif.yml and it will be solved: url: https://truezihaoxu.github.io/zhx-blog/","link":"/zhx-blog/2021/04/11/no-css-pos-generate/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post$ hexo new &quot;My New Post&quot; More info: Writing Run server$ hexo server More info: Server Generate static files$ hexo generate More info: Generating Deploy to remote sites$ hexo deploy More info: Deployment","link":"/zhx-blog/2021/04/11/hello-world/"},{"title":"The first photo taken in Portugal which is less random","text":"Well, it is less random but still quite random.","link":"/zhx-blog/2015/10/23/The-first-meaningful-photo-taken-in-Portugal/"},{"title":"First photo taken in Portugal","text":"Well it doesn’t make much sense.","link":"/zhx-blog/2015/09/15/First-photo-taken-in-Portugal/"}],"tags":[{"name":"🤬","slug":"🤬","link":"/zhx-blog/tags/%F0%9F%A4%AC/"},{"name":"🥳","slug":"🥳","link":"/zhx-blog/tags/%F0%9F%A5%B3/"},{"name":"🤨","slug":"🤨","link":"/zhx-blog/tags/%F0%9F%A4%A8/"},{"name":"No tag","slug":"No-tag","link":"/zhx-blog/tags/No-tag/"}],"categories":[{"name":"Hexo-Dev","slug":"Hexo-Dev","link":"/zhx-blog/categories/Hexo-Dev/"},{"name":"Dollar","slug":"Dollar","link":"/zhx-blog/categories/Dollar/"},{"name":"Misc","slug":"Misc","link":"/zhx-blog/categories/Misc/"},{"name":"subcat1","slug":"Hexo-Dev/subcat1","link":"/zhx-blog/categories/Hexo-Dev/subcat1/"},{"name":"Giveups","slug":"Hexo-Dev/Giveups","link":"/zhx-blog/categories/Hexo-Dev/Giveups/"},{"name":"Study","slug":"Study","link":"/zhx-blog/categories/Study/"},{"name":"Bio12","slug":"Study/Bio12","link":"/zhx-blog/categories/Study/Bio12/"},{"name":"Portuguese","slug":"Study/Portuguese","link":"/zhx-blog/categories/Study/Portuguese/"}]}