{"pages":[],"posts":[{"title":"First Post With Image (Original)","text":"","link":"/zhx-blog/2021/04/12/1st-image/"},{"title":"Doggo Vaccine","text":"Doggo got a vaccine ehehe.We went to a veterinary clinic at Arroios to get her a vaccine.","link":"/zhx-blog/2021/04/13/Doggo-Vaccine/"},{"title":"First Post With Image (Fixed)","text":"My first try failed, but now (after n tries) it is working normally!Now the images doesn’t have a description…why? (•_•;","link":"/zhx-blog/2021/04/12/First-Post-With-Image-Fixed/"},{"title":"I give up","text":"Damn it. I have been working on this for say more than 4 hours, but the damn Safari favicon never changed at all. Where the fuck did the Safari get that old favicon? WHERE IS THAT GOD DAMN OLD IMAGE’s SOURCE FILE??? WHERE IS MY NEW IMAGE???The source code (index.html) says that everything is in its place. But the God Damn favicon didn’t refresh.Everyting is working on Chrome. The shortcut icon on Safari works perfectly. Why the stupid tab icon didn’t change? I already tried:1: Open my website at Private mode (Safari)2: Delete all Safari favicon cache that I found in this directory: 1~/Library/Safari/Favicon Cache/ 3: Restart computerNothing above worked!But the Chrome has everything CORRECT! Damn it.No more hexo for today. I was really happy when I can put image on my site in the afternoon, but now I’m kinda pissed off.Oh btw, it was quite boring typing “hexo clean”, “hexo g” and “hexo d”. Not to mention the time that you have to wait between these commands. I found that this is a “compact version” of deploy command, it’s quite handy: 1hexo clean &amp;&amp; hexo g --d","link":"/zhx-blog/2021/04/12/I-give-up/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/zhx-blog/2021/04/11/hello-world/"},{"title":"Solved no CSS style after generation (hexo g)","text":"Just add this code into _congif.yml and it will be solved: 1url: https://truezihaoxu.github.io/zhx-blog/","link":"/zhx-blog/2021/04/11/no-css-pos-generate/"},{"title":"test-img","text":"Image is working after excuting this command in terminal (pwd: zhx-hexo): 1npm install https://github.com/7ym0n/hexo-asset-image --save The code above was copied from: CSDN Video example:","link":"/zhx-blog/2021/04/12/test-img/"},{"title":"Solved site logo not appearing in a hilarious way","text":"Just RESIZE that God Damn safari window and my logo (fraud alert! XD) appeared!Now I finally solved the logo problem, one more to go:favicon displays differentely on Safari and Chrome wtf?","link":"/zhx-blog/2021/04/12/Solved-site-logo-not-appearing-in-a-hilarious-way/"}],"tags":[{"name":"Hexo-Dev","slug":"Hexo-Dev","link":"/zhx-blog/tags/Hexo-Dev/"},{"name":"Dollar","slug":"Dollar","link":"/zhx-blog/tags/Dollar/"}],"categories":[]}